# Curated fresh-start stack (no installs executed automatically)
# Philosophy: OSS or one-time purchase where possible; avoid Google; quality first.

# taps
 tap "homebrew/cask"                 # Official casks for macOS GUI apps
 tap "homebrew/cask-fonts"          # Fonts including Nerd Fonts for terminals
 tap "nikitabobko/tap"              # AeroSpace tiling window manager cask
 tap "jdx/mise"                     # mise (rtx) runtime/version manager

# core CLI
 brew "git"                         # Distributed version control
 brew "gh"                          # GitHub CLI for auth/repos/issues/PRs
 brew "gnupg"                       # OpenPGP for signing and encryption
 brew "pinentry-mac"                # macOS passphrase dialog for GPG
 brew "age"                         # Simple, modern file encryption tool
 brew "sops"                        # Encrypted config management using age/GPG
 brew "jq"                          # JSON processor for scripts and CLI
 brew "yq"                          # YAML processor (jq‑like interface)
 brew "ripgrep"                     # Fast recursive code/text search
 brew "fd"                          # User-friendly find (fzf companion)
 brew "fzf"                         # Fuzzy finder for files/commands/history
 brew "bat"                         # cat with syntax highlighting and paging
 brew "eza"                         # Modern ls replacement with icons
 brew "tree"                        # Directory tree listing utility
 brew "htop"                        # Interactive process viewer/monitor
 brew "entr"                        # Run commands when files change
 brew "wget"                        # Robust network downloader
 brew "mas"                         # Mac App Store CLI for pinned installs

# prompt & shell helpers
 brew "starship"                    # Cross-shell prompt (fast, customizable)
 brew "direnv"                      # Per-directory envs; pairs well with mise

# runtimes (managed via mise)
 brew "mise"                        # Unified runtime manager (Node/Python/Java)

# containers (lighter host footprint than Docker Desktop)
 brew "colima"                      # Container runtime on macOS via Lima
 brew "docker"                      # Docker CLI client
 brew "docker-buildx"               # Extended multi-platform image builds
 brew "docker-compose"              # Define/run multi-container apps

# networking/dev tools
 brew "nmap"                        # Network scanner and discovery
 brew "httpie"                      # Friendly HTTP client for APIs

# GUI apps (casks)
 cask "cursor"                      # IDE (VS Code-compatible) – your primary
 cask "wezterm"                     # GPU-accelerated, configurable terminal
 cask "bitwarden"                   # Open-source password manager
 cask "tailscale"                   # Mesh VPN for devices and services

# launcher & window management
 cask "alfred"                   # One-time license launcher; file-based workflows, offline-first
 cask "nikitabobko/tap/aerospace"   # Keyboard-first tiling window manager
 # Lasso (manual install): https://thelasso.app/  # Mouse-driven arrange tool

# writing/notes/productivity
 cask "itsycal"                     # Lightweight menu bar calendar

# media
 cask "iina"                        # Modern video player (mpv-based)
 cask "jellyfin-media-player"       # Native client for Jellyfin server

# fonts
 cask "font-jetbrains-mono-nerd-font"  # Dev font with symbols for terminals

# browsers
 # Zen Browser: not in core taps yet; install manually or custom tap.
 # cask "vivaldi"                    # Chromium-based browser (privacy-friendly)
 # cask "eloston-chromium"          # Ungoogled Chromium variant

# End of curated list
