# Curated fresh-start stack (no installs executed automatically)
# Philosophy: OSS or one-time purchase where possible; avoid Google; quality first.

# taps
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "nikitabobko/tap"        # AeroSpace (tiling WM, OSS)
tap "jdx/mise"               # mise runtime manager

# core CLI
brew "git"
brew "gh"                     # GitHub CLI
brew "gnupg"
brew "pinentry-mac"
brew "age"                    # modern encryption
brew "sops"
brew "jq"
brew "yq"
brew "ripgrep"
brew "fd"
brew "fzf"
brew "bat"
brew "eza"
brew "tree"
brew "htop"
brew "entr"
brew "wget"
# brew "mas"                  # Mac App Store CLI (optional)

# prompt & shell helpers
brew "starship"
brew "direnv"                 # optional; good with mise

# runtimes (managed via mise)
brew "mise"

# containers (lighter than Docker Desktop)
brew "colima"
brew "docker"
brew "docker-buildx"
brew "docker-compose"

# networking/dev tools
brew "nmap"
brew "httpie"

# GUI apps (casks)
cask "cursor"
cask "wezterm"
cask "bitwarden"
cask "tailscale"

# launcher & window mgmt
cask "raycast"                # free; consider "alfred" (one-time) if preferred
cask "rectangle"              # OSS tiling
# Lasso (manual install): https://thelasso.app/
cask "nikitabobko/tap/aerospace"   # advanced tiling (manual config)

# writing/notes/productivity
cask "obsidian"
cask "itsycal"

# media
cask "iina"
cask "jellyfin-media-player"

# fonts
cask "font-jetbrains-mono-nerd-font"

# browsers
# Zen Browser: not in core taps yet; install manually or custom tap.
# cask "vivaldi"
# cask "eloston-chromium"      # ungoogled chromium variant

# End of curated list
