tap "nikitabobko/tap"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Load/unload environment variables based on $PWD
brew "direnv"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# CLI for Headscale (self-hosted Tailscale control server)
brew "headscale-cli"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Run large language models locally
brew "ollama"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Cross-shell prompt for astronauts
brew "starship"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Immich CLI for bulk photo uploads to self-hosted Immich instance
brew "immich-cli"
# HTTP file sharing hub with WebDAV, SFTP, FTP, SMB support
brew "copyparty"
# AeroSpace is an i3-like tiling window manager for macOS
cask "aerospace"
# Customizable dock replacement with enhanced features
cask "activedock"
# Application launcher and productivity software
cask "alfred"
# Android SDK component
cask "android-platform-tools"
# Desktop password and login vault
cask "bitwarden"
# Bitwarden CLI for headless credential access (passwords in Keychain or .env)
brew "bitwarden-cli"
# Advanced Finder replacement with multi-pane layouts and enhanced file management
cask "bloom"
# Shortcut viewer - shows keyboard shortcuts when holding Command key
cask "cheatsheet"
# Tool to run Windows software
cask "crossover"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker-desktop"
cask "font-jetbrains-mono-nerd-font"
# Desktop automation application
cask "hammerspoon"
# Menu bar items manager (beta version for macOS Sequoia compatibility)
# cask "jordanbaird-ice" # Using direct GitHub download v0.11.13-dev.2 
# See GitHub Issue #720: "fix: Disable swizzling for macOS 26 and above"
# Companion app for Home Assistant home automation software
cask "home-assistant"
# Free and open-source media player
cask "iina"
# Menu bar calendar
cask "itsycal"
# Keyboard customiser
cask "karabiner-elements"
# Discover, download, and run local LLMs
cask "lm-studio"
# Software for Logitech devices
cask "logi-options+"
# WiFi site survey software and WiFi scanner
cask "netspot"
# Desktop GUI for Ollama (local LLM management)
cask "ollama-app"
# Imaging utility to install operating systems to a microSD card
cask "raspberry-pi-imager"
# Replacement for the volume, brightness and keyboard backlight HUDs
cask "slimhud"
# Application to control your PlayStation 4 or PlayStation 5
cask "sony-ps-remote-play"
# Music streaming service
cask "spotify"
# Video game digital distribution service
cask "steam"
# Open-source media center
cask "stremio"
# Mesh VPN based on WireGuard
cask "tailscale-app"
# Messaging app with a focus on speed and security
cask "telegram"
# SSH client
cask "termius"
# Virtual machines UI using QEMU
cask "utm"
# Network monitoring and UniFi Teleport VPN client
cask "wifiman"
# Seafile desktop client for file sync with self-hosted Seafile server
cask "seafile-client"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
vscode "anysphere.cursorpyright"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "vscodevim.vim"
